Revit 2024 API
FileExportingEventArgs.Path Property
 The target path for the export.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2010
Syntax
C#
public string Path { get; }
Visual Basic
Public ReadOnly Property Path As String
	Get
Visual C++
public:
property String^ Path {
	String^ get ();
}
Remarks
 When several files are exported at the same time, 'Path' property will just report the directory instead of those full file names.
See Also
FileExportingEventArgs Class
Autodesk.Revit.DB.Events Namespace